In [1]:
import pandas as pd
from sqlalchemy import create_engine, inspect
# from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
avo_data = pd.read_csv('avocado.csv')
avo_data.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [3]:
new_df = avo_data.drop(['Unnamed: 0', 'type','Total Volume', '4046', '4225', '4770','Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'year'], axis=1)
new_df.head()

         Date  AveragePrice  region
0  2015-12-27          1.33  Albany
1  2015-12-20          1.35  Albany
2  2015-12-13          0.93  Albany
3  2015-12-06          1.08  Albany
4  2015-11-29          1.28  Albany

In [4]:
avo_dates = new_df.groupby('Date').mean()
df = avo_dates.reset_index()
df.head()

         Date  AveragePrice
0  2015-01-04      1.301296
1  2015-01-11      1.370648
2  2015-01-18      1.391111
3  2015-01-25      1.397130
4  2015-02-01      1.247037

In [5]:
connection_string = 'root:password@localhost/avocado_db'
engine = create_engine('mysql://root:@localhost/avocado_db')
# engine = create_engine(f'mysql://{connection_string}')

In [6]:
# if not database_exists(engine.url):
#     create_database(engine.url)
    
# print(database_exists(engine.url))

In [7]:
conn = engine.connect()

In [8]:
inspector = inspect(engine)

In [9]:
df.to_sql(name='test', con=engine, if_exists='append', index=True)

In [10]:
engine.table_names()

['test']

In [11]:
pd.read_sql_query('select * from test', con=engine).head()

   index        Date  AveragePrice
0      0  2015-01-04      1.301296
1      1  2015-01-11      1.370648
2      2  2015-01-18      1.391111
3      3  2015-01-25      1.397130
4      4  2015-02-01      1.247037